app/views/users/show.html.erb

			</tr>
			<% Event.all.each do |event| %>
---
SELECT "events".* FROM "events"