app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "updated_at", "creator_id") VALUES (?, ?, ?)  [["created_at", "2018-05-07 09:37:40.563843"], ["updated_at", "2018-05-07 09:37:40.563843"], ["creator_id", 1]]
---
  def create
    respond_to do |format|
      if event_params_create.save

UPDATE "events" SET "price" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["price", 16.0], ["updated_at", "2018-05-07 16:05:27.003245"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @event.update(event_params_update)

INSERT INTO "event_attendees" ("attendee_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["attendee_id", 1], ["event_id", 9], ["created_at", "2018-05-08 17:12:00.423904"], ["updated_at", "2018-05-08 17:12:00.423904"]]
---
  def event_subscribe
    @event.attendees << current_user