app/controllers/users_controller.rb

SELECT "events".* FROM "events"
---
  def user_event
    @my_event = Event.all.select{ |event| event.creator == current_user }